import Drawer from '@/components/common/Drawer/Drawer'

const ApplicationHelp = () => {
  return (
    <div className="flex flex-col space-y-3">
      <Drawer id="section-0" title={'اختلال در بارگذاری اپلیکیشن'} defaultOpen>
        <p>
          {
            'اگر در صورت داشتن اینترنت در اپلیکیشن اطلاعات شما بارگذاری نشد می توانید وارد تنظیمات اپلیکیشن خود شوید cache یا data اپلیکیشن خود را پاک کنید و دوباره با اطلاعات خود وارد اپلیکیشن شوید.'
          }
        </p>
      </Drawer>
      <Drawer id="section-1" title={'ورود به بخش پروفایل'}>
        <p>
          {
            'برای ورود به بخش پروفایل بر روی عکس خود در گوشه سمت راست کلیک کرده و اطلاعات پروفایل و دکمه خروج از اپلیکیشن را مشاهده کنید.'
          }
        </p>
      </Drawer>
      <Drawer id="section-2" title={'بخش داشبورد کاربری'}>
        <p>
          {
            'در بخش داشبورد کاربری شما می توانید آخرین آزمون - تاریخ و زمان آزمون پیش رو - اخبار - و پیام ها و اطلاعیه های خود را مشاهده کنید.'
          }
        </p>
      </Drawer>
      <Drawer id="section-3" title={'بخش کارنامه ها'}>
        <p>
          {
            'در این بخش شما می توانید کار نامه های خود را مشاهده و دانلود کنید که شامل کارنامه های گوناگون میشود مثل کارنامه زودهنگام کارنامه اصلی و .... برای دانلود کارنامه ها کافی است اگر متن دکمه آن (مشاهده) است یک بار بر روی آن کلیلک کنید سپس مشاهده کنید و برای دیگر کارنامه هایی که متن دکمه آن ها (دانلود) است یک بار کلیک کنید صبر کنید تا کارنامه آماده شود بعد از آماده شدن کار نامه یک برا دیگر روی آن کلیک کنید تا کارنامه دانلود شود.'
          }
        </p>
      </Drawer>
      <Drawer id="section-4" title={'بخش رویداد'}>
        <p>
          {
            'در این بخش تقویم قرار دارد که در آن تاریخ رویداد ها و همچنین کلاس هایی که برگذار می شوند وجود دارد که از این طریق میتوانید در ساعت و تاریخ برگذاری درون کلاس ها شرکت کنید و می توانید با کلیک بر روی روز ها بر روی تقویم اطلاعات بیشتری در مورد رویداد کسب کنید.'
          }
        </p>
      </Drawer>
      <Drawer id="section-4" title={'بخش پادکست'}>
        <p>
          {
            'در این بخش پادکست های کانون و مصاحبه ها با افراد برتر کانون وجود دارد که می توانید با فیلتری که در بالای لیست وجود دارد موضوع پادکست را انتخاب کرده و به آن گوش دهید.'
          }
        </p>
      </Drawer>
      <Drawer id="section-4" title={'بخش پیام ها'}>
        <p>
          {
            'در این بخش می توانید به پیام ها و اطلاعیه هایی که برای شما بارگذاری شده است دسترسی داشته باشید.'
          }
        </p>
      </Drawer>
      <Drawer id="section-4" title={'بخش فایل ها'}>
        <p>
          {
            'در این بخش می توانید به فایل هایی که برای شما بارگذاری شده است دسترسی داشته باشید.'
          }
        </p>
      </Drawer>
      <Drawer id="section-4" title={'بخش پشتیبانی'}>
        <p>
          {
            'در این بخش می توانید ثبت درخواست پشتبیانی کنید به بخشی که نیاز دارید و همچنین نوع مشکل خود را ثبت کنید و توضیحات آن را بیان کنید و در تب درخواست های من منتظر پاسخ از واحد مربوطه باشید و همچنین در بخش راهنمای اپلیکیشن می توانید  به راهنمای استفاده از اپلیکیشن کانونی ها دسترسی داشته باشید.'
          }
        </p>
      </Drawer>
    </div>
  )
}

export default ApplicationHelp
